

# Тема "БД" - количество определенной марки автомобиля на складе
while 1:
    print("Выбирете действие :")
    print("1 - первичного заполнения словаря с клавиатуры")
    print("2 - сохранения данных во внешний файл")
    print("3 - считывания данных в словарь при наличии связанного внешнего файла")
    print("4 - добавления данных в словарь с последующим сохранением в файле данных")
    print("5 - изменения и удаления информации")
    print("6 - поиска информации по ключу")
    print("7 - сортировки информации по ключу")

    choice = int(input("Ввдете цифру\n"))

    if (choice == 1):
        pass
    if (choice == 2):
        pass
    if (choice == 3):
        pass
    if (choice == 4):
        pass
    if (choice == 5):
        pass
    if (choice == 6):
        pass
    if (choice == 7):
        pass
